Oldmaterials/cylinder-re73000/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    pipe
    {
        type            wall;
        nFaces          160;
        startFace       125970;
    }
    walls
    {
        type            patch;
        nFaces          480;
        startFace       126130;
    }
    inlet
    {
        type            patch;
        nFaces          110;
        startFace       126610;
    }
    outlet
    {
        type            patch;
        nFaces          110;
        startFace       126720;
    }
    defaultFaces
    {
        type            empty;
        nFaces          126400;
        startFace       126830;
    }
)

// ************************************************************************* //
