Oldmaterials/cylinder-re73000/constant/acousticDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      acousticDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

sonicSpeedDefinition
{
    type		default;
    defaultValue	1500;
}

acousticSource
{
    type		icoInviscid;
    fluidDensity	1000;
    Uname		U;
}

// ************************************************************************* //
