Oldmaterials/cylinder-re73000/constant/cellProbeDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          cellProbeDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

probe		false;

fileNamePrefix	acp_;
fileNameExt	csv;
outFrequency	10;

fieldsNames
(
    acp
);

cellsCoords
(
    (-0.148861052636331 0.64716124109461 0.0)
    ( 0.018367630425726 0.64716124109461 0.0)
    ( 0.312690112614946 0.64716124109461 0.0)
    ( 0.312690112614946 0.64716124109461 0.0)
);

// ************************************************************************* //
