Oldmaterials/cylinder-re73000/system/decomposeParDict
// Mesh decomposition control dictionary

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

FoamFile
{
    version 0.5;
    format ascii;

    root     "ROOT";
    case     "CASE";
    instance "system";
    local    "";

    class dictionary;

    object decompositionDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains   12;

//method               simple;
//method               hierarchical;
method               scotch;
//method               manual;

simpleCoeffs
{
    n                    (1 1 2);
    delta                0.0001;
}

hierarchicalCoeffs
{
    n                    (1 1 4);
    delta                0.001;
    order                xyz;
}

scotchCoeffs
{
}

manualCoeffs
{
    dataFile             "decompositionData";
}

// ************************************************************************* //
